"""
Вам дано рядок з двома позначками (початковою і кінцевою).
Ви повинні знайти підрядок яка знаходиться між двома позначками.
Але є декілька важливих умов:
Початкова і кінцева позначка завжди різні
Якщо не має початкової позначки, тоді перший символ повинен
знаходитись на початку рядка
Якщо не має кінцевої позначки, тоді останій символ повинен
знаходитись в кінці рядка
Якщо початкова і кінцева позначки відсутні, тоді необхідно
просто повернути рядок цілком
Якщо кінцева позначка іде перед початковою повернути пустий рядок
Вхідні дані: Три аргументи. Всі стрічки. Другий і третій аргумент
- це початкова і кінцева позначки.
Вихідні дані: Стрічка.
Як це використовується: для аналізу текстів
Передумова: не може бути більше однієї початкої і однієї кінцевої позначки
"""
